subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
//************************************************************************************
// Ref(v12.1)
// Project : ESP32 Universal CC/CV Charger Controller
// Version : v12.2
// Date    : 2024-03-30
//
// Changelog (v12.2):
//    - Added charge-mode time visibility (elapsed / total) for ABSORPTION, FLOAT, IDLE
//    - Serial log now shows NEXT MODE transition (→ IDLE / → BULK)
//    - Globalized internal mode timers for safe debug visibility
//    - Improved simulation support for precise mode-transition testing
//    - Refined ABSORPTION → IDLE behavior for lithium chemistries
//    - Logging structure optimized for readability and field diagnostics
//    - Minor cleanup of timer synchronization and debug consistency
//
// Features:
//    - Full hysteresis-based state machine:
//      BULK → ABSORPTION → FLOAT → BACKUP → IDLE → BULK
//    - Strict separation of:
//        • Charge STATE logic (updateChargeMode)
//        • PWM CONTROL logic (adjustPWM)
//    - All hysteresis, limits, and timings sourced from battery_types.h
//    - Battery-specific CC/CV charging profiles
//    - Enforced minimum dwell time per charge mode
//    - Overvoltage protection forces BACKUP with hard PWM shutdown
//    - Lithium chemistries: NO FLOAT, controlled ABSORPTION → IDLE
//    - IDLE exit requires voltage + time hysteresis
//    - Simulation mode for deterministic state-machine validation
//    - Web interface for monitoring and configuration
//    - ADS1115 + ACS712 battery sensing with auto calibration
//    - Load control (AUTO / MANUAL) with overload & hiccup protection
//    - DS18B20-based thermal fan control
//    - 20x4 LCD + Web UI, WiFi + mDNS, audible alerts
//    - Automatic 24-hour system reboot for long-term stability
//
// Hardware:
//    - MCU    : DOIT ESP32 DEVKIT V1 (38-pin)
//    - ADC    : ADS1115 @5V via bi-directional LLC (GAIN_TWOTHIRDS)
//    - Driver : IR2104 Half-Bridge Driver (Synchronous Buck)
//    - MOSFETs: High-Side N-CH + Low-Side N-CH
//    - Buzzer : Active buzzer for audible alerts
//    - Display: 20x4 I2C LCD
//
// Hardware Notes:
//    - INPUT/BAT sensed via shared divider
//      (100k / (17.5k)) ≈ 6.71× scaling
//    - ACS712 calibrated at startup with flash persistence
//    - I2C fixed at 200kHz with GPIO bus recovery
//    - PWM limited to 70–85% for IR2104 bootstrap safety
//    - PWM resolution: 10-bit
//    - IR2104 SD pin (GPIO33):
//        HIGH = Active, LOW = Shutdown (High-Z)
//        Disabled ONLY in IDLE / BACKUP after delay
//
//************************************************************************************



//************************************************************************************
// Configuration Flags  {Serial.print -> Enabled/Disabled}
//************************************************************************************
#define ENABLE_SERIAL_DEBUG 1  // 0 = Disabled, 1 = Enabled

//************************************************************************************
// Debug Print Macros
//************************************************************************************
#if ENABLE_SERIAL_DEBUG
#define DEBUG_PRINT(...) Serial.print(__VA_ARGS__)
#define DEBUG_PRINTLN(...) Serial.println(__VA_ARGS__)
#define DEBUG_PRINTF(fmt, ...) Serial.printf(fmt, ##__VA_ARGS__)
#else
#define DEBUG_PRINT(...)
#define DEBUG_PRINTLN(...)
#define DEBUG_PRINTF(fmt, ...)
#endif

//************************************************************************************
// Library Includes
//************************************************************************************
#include <Arduino.h>
#include <Wire.h>                // I2C communication library
#include <Adafruit_ADS1X15.h>    // ADS1115 ADC library
#include <LiquidCrystal_I2C.h>   // I2C LCD library
#include <math.h>                // Mathematical functions
#include <WiFi.h>                // WiFi connectivity library
#include <WiFiManager.h>         // Simplifies WiFi configuration and captive portal
#include <WebServer.h>           // ESP32 Web server library
#include <ESPmDNS.h>             // mDNS for hostname access
#include <Bounce2.h>             // Button debounce library
#include <OneWire.h>             // 1-Wire bus library
#include <DallasTemperature.h>   // DS18B20 temperature sensor library
#include <esp_task_wdt.h>        // ESP32 Task Watchdog Timer library
#include <Preferences.h>         // Flash storage for persistent settings

//************************************************************************************
// Application-specific headers
//************************************************************************************
#include "controller_types.h"
#include "battery_types.h"
#include "fan_control.h"
#include "charger_web.h"
#include "WiFiSignalHelpers.h"
#include "wifi_sys.h"
#include "buzzer_sys.h"

//************************************************************************************
// LEDC Compatibility Macros for ESP32 Core v3.0+
//************************************************************************************
#if ESP_ARDUINO_VERSION_MAJOR >= 3
// In Core v3.0, ledcAttach returns bool and takes (pin, freq, res). Channel is auto-managed.
#define COMPAT_LEDC_ATTACH(pin, channel, freq, res) ledcAttach(pin, freq, res)
// In Core v3.0, ledcWrite takes (pin, duty). Channel is ignored/deprecated.
#define COMPAT_LEDC_WRITE(pin, channel, duty) ledcWrite(pin, duty)
#else
// In Core v2.x, we must manually setup channel and attach pin.
#define COMPAT_LEDC_ATTACH(pin, channel, freq, res) do { ledcSetup(channel, freq, res); ledcAttachPin(pin, channel); } while(0)
// In Core v2.x, ledcWrite takes (channel, duty).
#define COMPAT_LEDC_WRITE(pin, channel, duty) ledcWrite(channel, duty)
#endif

//************************************************************************************
// Global Voltage Range Constants - Fallback Safety Values
//************************************************************************************
const float MIN_BATTERY_VOLTAGE = 10.5f; // Safe fallback for error conditions
const float MAX_BATTERY_VOLTAGE = 12.7f; // Safe fallback for error conditions

//************************************************************************************
// Global LCD Refresh Constants
//************************************************************************************
const int LCD_REFRESH_RATE_MS = 800; // LCD refresh interval in milliseconds
const unsigned long FLASH_CYCLE_MS = 2000UL; // LED flash cycle duration
const unsigned long FLASH_ON_DURATION_MS = 1000UL; // LED flash on duration

//************************************************************************************
// Watchdog Configuration for System Stability
//************************************************************************************
#define WATCHDOG_TIMEOUT 60    // Watchdog timeout in seconds
#define WATCHDOG_FEED_INTERVAL 8000  // Feed watchdog every 8 seconds (conservative)
unsigned long lastWatchdogFeed = 0;

//************************************************************************************
// Non-blocking Delay Structure for Smooth Operation
//************************************************************************************
struct NonBlockingDelay {
  unsigned long previousMillis;

  bool isComplete(unsigned long interval) {
    unsigned long currentMillis = millis();
    if (currentMillis - previousMillis >= interval) {
      previousMillis = currentMillis;
      return true;
    }
    return false;
  }
  void reset() {
    previousMillis = millis();
  }
};

// Create delay instances for different operations
NonBlockingDelay wifiDelay;
NonBlockingDelay sensorDelay;
NonBlockingDelay lcdDelay;
NonBlockingDelay beepDelay;
NonBlockingDelay logDelay;
NonBlockingDelay ipPrintDelay;
NonBlockingDelay watchdogDelay;
NonBlockingDelay eepromDelay; // Kept name for compatibility, used for persistence delays

//************************************************************************************
// Web Server and Global System Variables
//************************************************************************************
WebServer server(80); // Web server running on port 80
Preferences preferences; // Defined globally here for access across functions

// Sensor readings - consolidated global variables
float bat_voltage = 0.0, input_voltage = 0.0, Current_A = 0.0, temperatureC = 0.0;
int pwm_value = 0;
int pwm_last = 0; // Global tracking for soft-start logic

