subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
Bounce buttonMode;
Bounce buttonLoad;
Bounce buttonWiFiReset;
Bounce buttonCalibrate;

//************************************************************************************
// Temporary Manual Load Control in AUTO Mode
//************************************************************************************
bool tempLoadOn = false;
unsigned long tempLoadStart = 0;
const unsigned long TEMP_LOAD_DURATION = 30000; // 30 seconds temporary load duration
bool autoBeepPending = false;

//************************************************************************************
// AUTO-mode Beep Patterns for Load Change Alerts
//************************************************************************************
bool nextToggleIsManual = false;
const int  AUTO_PRE_BEEP_COUNT   = 6;   // Number of beeps before load change
const int  AUTO_PRE_BEEP_ON_MS   = 120; // Beep on duration (ms)
const int  AUTO_PRE_BEEP_OFF_MS  = 120; // Beep off duration (ms)

const unsigned long TEMP_OFF_WARN_LEAD_MS = 2000; // Warning time before temp load off
const int  AUTO_EXPIRY_BEEP_COUNT  = 6;   // Number of beeps for temp load expiry
const int  AUTO_EXPIRY_BEEP_ON_MS  = 120; // Expiry beep on duration (ms)
const int  AUTO_EXPIRY_BEEP_OFF_MS = 120; // Expiry beep off duration (ms)

//************************************************************************************
// Critical Battery Warning Threshold
//************************************************************************************
const float CRIT_BATT_WARN_MARGIN = 0.10f; // Voltage margin for critical battery warning

//************************************************************************************
// Surge current protection timing
//************************************************************************************
static unsigned long lastPWMChange = 0;
const unsigned long MIN_PWM_CHANGE_INTERVAL = 20;  // 20ms minimum between PWM changes
static int lastPWMValue = 0;
static float lastCurrent = 0.0f;

//************************************************************************************
// System Health Monitoring
//************************************************************************************
struct SystemHealth {
  uint32_t totalUptime;
  uint16_t watchdogResets;
  uint16_t i2cRecoveries;
  uint16_t overloadEvents;
  uint32_t lastHeapCheck;
  uint32_t minFreeHeap;
};

SystemHealth systemHealth = {0, 0, 0, 0, 0, UINT32_MAX};

//************************************************************************************
// Schedule Load Toggle with Pre-alert Beeps
//************************************************************************************
void scheduleLoadToggle(bool turnOn) {
  // Prevent multiple simultaneous load changes to avoid conflicts
  if (pendingLoadChange || isBeepActive()) return; // Added beep active check

  // Set up pending load change for deferred execution
  pendingLoadChange = true;
  pendingTurnOn = turnOn;
  // Start appropriate pre-alert beep pattern based on control mode
  (loadControlMode == AUTO) ?
  startBeepPattern(AUTO_PRE_BEEP_COUNT, AUTO_PRE_BEEP_ON_MS, AUTO_PRE_BEEP_OFF_MS, BEEP_PRIORITY_NORMAL) :
  startLoadPreAlertBeep(turnOn);
}

//************************************************************************************
// Execute Scheduled Load Toggle After Beep Pattern
//************************************************************************************
void finalizeLoadToggle() {
  // Atomic flag protection with interrupt disable for ESP32
  static volatile bool inFinalize = false;
  portDISABLE_INTERRUPTS();  // Disable interrupts for atomic operation
  if (inFinalize) {
    portENABLE_INTERRUPTS();
    return;
  }
  inFinalize = true;
  portENABLE_INTERRUPTS();

  // Apply the scheduled load state change to hardware
  digitalWrite(load_enable, pendingTurnOn ? HIGH : LOW);
  load_is_on = pendingTurnOn;
  load_status = load_is_on ? "On " : "Off";
  lastLoadChangeTime = millis();

  // Handle temporary load in AUTO mode with expiration logic
  if (loadControlMode == AUTO && load_is_on && nextToggleIsManual) {
    tempLoadOn = true;
    tempLoadStart = millis();
    autoBeepPending = false;
  } else {
    tempLoadOn = false;
    autoBeepPending = false;
  }

  // Reset toggle flags to prepare for next operation
  nextToggleIsManual = false;
  pendingLoadChange = false;

  portDISABLE_INTERRUPTS();
  inFinalize = false; // Release lock
  portENABLE_INTERRUPTS();
}

//************************************************************************************
// Battery Selection Menu at Startup (20-second maximum timeout)
// Uses non-blocking beep patterns for responsive UI
//************************************************************************************
void batterySelectionMenu() {
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Select Battery:");

  int menuIndex = selectedBattery;
  unsigned long menuStart = millis();
  bool selected = false;
  unsigned long lastButton1 = 0, lastButton2 = 0;
  int lastCountdown = 21;

  const int MENU_TIMEOUT_SEC = 20; // Maximum 20 seconds as requested
  const int pageSize = 3;

  // Menu loop with timeout and user interaction handling
  while (!selected && (millis() - menuStart < (unsigned long)MENU_TIMEOUT_SEC * 1000UL)) {
    buttonMode.update();
    buttonLoad.update();

    // Display menu page with pagination support
    int page = menuIndex / pageSize;
    int start = page * pageSize;
    for (int r = 0; r < pageSize; r++) {
      int idx = start + r;
      lcd.setCursor(0, r + 1);
      if (idx < BATTERY_TYPE_COUNT) {
        lcd.print(idx == menuIndex ? ">" : " ");
        lcd.print(batteryTable[idx].name);
        int len = strlen(batteryTable[idx].name);
        for (int j = len + 1; j < 19; j++) lcd.print(" ");
      } else {
        lcd.print("                    ");
      }
    }

    // Update countdown timer display
    int countdown = MENU_TIMEOUT_SEC - ((millis() - menuStart) / 1000);
    if (countdown != lastCountdown) {
      lcd.setCursor(15, 0); lcd.print("     ");
      lcd.setCursor(15, 0);
      lcd.print("[");
      if (countdown < 10) lcd.print(" ");
      lcd.print(countdown); lcd.print("s]");
      lastCountdown = countdown;
    }

    // Handle button presses with debounce and guaranteed beep (NON-BLOCKING)
    if (buttonMode.fell() && millis() - lastButton1 > 200) {
      menuIndex = (menuIndex + 1) % BATTERY_TYPE_COUNT;
      startBeepPattern(1, 80, 50, BEEP_PRIORITY_NORMAL, true); // Non-blocking force beep
      lastButton1 = millis();
    }
    if (buttonLoad.fell() && millis() - lastButton2 > 200) {
      selected = true;
      startBeepPattern(1, 150, 50, BEEP_PRIORITY_NORMAL, true); // Non-blocking force beep
      break;
    }

    updateBeepPattern();
    delay(10);
  }

  // Save selected battery or use previous with Preferences
  if (selected) {
    // Only write to Preferences if battery type actually changed
    if (selectedBattery != (BatteryType)menuIndex) {
      selectedBattery = (BatteryType)menuIndex;
      // Save to Preferences
      preferences.begin("settings", false);
      preferences.putUChar("batType", (uint8_t)selectedBattery);
      preferences.end();
      DEBUG_PRINTF("Battery type changed to %s, Preferences updated\n",
                   batteryTable[selectedBattery].name);
    }
  } else {
    // Timeout - Load from Preferences
    preferences.begin("settings", true);
    uint8_t savedType = preferences.getUChar("batType", 0);
    preferences.end();

    selectedBattery = (BatteryType)savedType;
    if (selectedBattery >= BATTERY_TYPE_COUNT) selectedBattery = LEAD_ACID_12V_7AH;

    lcd.clear();
    lcd.setCursor(0, 0);
    lcd.print("Timeout, using");
    lcd.setCursor(0, 1); lcd.print("previous battery!");
    ensureBeep(150, 100); // Guaranteed beep for timeout
    delay(1000);
  }

  currentBattery = batteryTable[selectedBattery];
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Battery Selected:");
  lcd.setCursor(0, 1); lcd.print(currentBattery.name);
  // Debug log
  DEBUG_PRINTLN("Battery Selected:");
  DEBUG_PRINTLN(currentBattery.name);
  ensureBeep(200, 100); // Guaranteed confirmation beep
  delay(1000);
}

//************************************************************************************
// ACS712 Zero-current Offset Calibration with Preferences Storage (10-second window)
// Performs statistical sampling with median calculation for accurate calibration
//************************************************************************************
void performCalibration() {
  DEBUG_PRINTLN("Starting calibration process...");
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Start Calibrating...");
  // GUARANTEED BEEP WHEN STARTING CALIBRATION
  ensureBeep(300, 150); // Long confirmation beep

  // Turn off PWM for calibration to ensure accurate readings
  writePWMClamped(0);

  delay(500); // Brief pause before starting

  lcd.setCursor(0, 1); lcd.print("Collect Sampling...");
  lcd.setCursor(0, 2); lcd.print("Progress: ");
  // Optimized sampling for speed and accuracy
  const int SAMPLES = 500;
  // Move large array to static storage to reduce stack pressure
  static float readings[SAMPLES];
  int validCount = 0;
  // Collect samples for statistical accuracy with audible feedback
  for (int i = 0; i < SAMPLES; i++) {
    // Use defined channel for current sensor
    int16_t raw = ads.readADC_SingleEnded(ADS_PIN_CURRENT_SENSOR);
    float v = ads.computeVolts(raw);

    // Validate reading range more strictly (2.0V to 3.0V for 5V sensor @ VCC/2)
    if (v > 2.0f && v < 3.0f) {
      readings[validCount++] = v;
    }

    // Update progress display and beep synchronously every 25 samples
    if (i % 25 == 0) {
      lcd.setCursor(10 + (i / 25), 2);
      lcd.print(".");

      // Force beep to bypass rate limits inside this tight loop
      buzzOn(true);
      delay(20);
      buzzOff(true);
    }

    // Feed watchdog every 10 samples for safety
    if (i % 10 == 0) feedWatchdog();
    delay(2); // Small delay to prevent issues
  }

  // Check if we have enough valid samples
  if (validCount < SAMPLES * 0.7) {
    DEBUG_PRINTLN("ERROR: Too many invalid samples!");
    lcd.setCursor(0, 3); lcd.print("ERR Invalid Samples!");

    // Three beeps for error indication - guaranteed
    for (int i = 0; i < 3; i++) {
      ensureBeep(150, 150); // Guaranteed error beeps
    }

    delay(1500);
    return;
  }

  // Simple bubble sort for median calculation (sort only for median)
  for (int i = 0; i < validCount - 1; i++) {
    for (int j = i + 1; j < validCount; j++) {
      if (readings[i] > readings[j]) {
        float t = readings[i];
        readings[i] = readings[j];
        readings[j] = t;
      }
    }
  }

