subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
  lcd.setCursor(0, 1);
  lcd.print("T-Sens DS18B20 ");
  lcd.print(ds18b20Found ? "OK" : "FAIL");

  lcd.setCursor(0, 2);
  lcd.print("C-Sens ADS1115 ");
  lcd.print(ads_connected ? "OK" : "FAIL");
  bool allOK = ds18b20Found && ads_connected;
  if (allOK) {
    unsigned long t0 = millis();
    while (millis() - t0 < 3000) {
      updateBeepPattern();
      delay(10);
    }
  }
}

//************************************************************************************
// Load Mode Persistence: AUTO=0, MANUAL=1
// Uses Preferences Library for reliable flash storage
//************************************************************************************
void persistLoadMode() {
  // Only write if value has changed
  preferences.begin("settings", false);
  uint8_t modeByte = (loadControlMode == MANUAL) ? 1 : 0;
  uint8_t current = preferences.getUChar("loadMode", 255); // Default invalid

  if (current != modeByte) {
    preferences.putUChar("loadMode", modeByte);
    DEBUG_PRINTF("Load mode changed to %s, Preferences updated\n",
                 (loadControlMode == AUTO) ? "AUTO" : "MANUAL");
  }
  preferences.end();
}

//************************************************************************************
// Restore Load Mode from Preferences
// Loads saved load control mode from flash storage
//************************************************************************************
void restoreLoadMode() {
  preferences.begin("settings", true);
  uint8_t modeByte = preferences.getUChar("loadMode", 0); // Default 0 (AUTO)
  preferences.end();

  loadControlMode = (modeByte == 1) ? MANUAL : AUTO;
  loadControlModeStr = (loadControlMode == AUTO) ? "A" : "M";
}

//************************************************************************************
// Load Protection Function - Call in main loop
// Monitors current and triggers protection if threshold exceeded
//************************************************************************************
void checkLoadProtection() {
  // Skip if protection is disabled
  if (!loadProtectionEnabled) {
    overcurrentCount = 0; // Reset counter
    return;
  }

  // Reset retry counter after timeout (5 minutes)
  if (protectionRetryCount > 0 &&
      millis() - lastRetryResetTime > RETRY_RESET_TIMEOUT) {
    protectionRetryCount = 0;
    lastRetryResetTime = millis();
    DEBUG_PRINTLN("Load protection retry counter reset after timeout");
  }

  // Check for overcurrent condition
  if (Current_A >= LOAD_PROTECTION_CURRENT) {
    overcurrentCount++;
    lastOvercurrentTime = millis();
    // If overcurrent detected LOAD_OVERCURRENT_COUNT times consecutively
    if (overcurrentCount >= LOAD_OVERCURRENT_COUNT) {
      // INSTANT CUTOFF - Immediate load shutdown

      // Only increment retry count once per trip event
      if (!loadWasTripped) {
        protectionRetryCount++;
        lastRetryResetTime = millis(); // Reset timeout on new fault
      }

      digitalWrite(load_enable, LOW);
      load_is_on = false;
      load_status = "off";
      loadProtectionActive = true;
      loadWasTripped = true;
      lastLoadChangeTime = millis();

      // Reset detection counter immediately
      overcurrentCount = 0;
      // Play distinctive alarm pattern for overload - guaranteed
      startBeepPattern(5, 200, 100, BEEP_PRIORITY_CRITICAL, true); // 5 long beeps - immediate

      DEBUG_PRINTF("LOAD PROTECTION TRIPPED: %.2fA >= %.2fA\n",
                   Current_A, LOAD_PROTECTION_CURRENT);
    }
  } else {
    // Reset counter when current is below threshold
    overcurrentCount = 0;
  }

  // Auto-reset protection after 5 seconds if load was tripped
  if (loadWasTripped && (millis() - lastOvercurrentTime > LOAD_PROTECTION_RESET_TIME)) {
    resetLoadProtectionAuto();
  }
}

//************************************************************************************
// Auto Reset Load Protection (called after timeout)
// Includes logic to Latch OFF after MAX_PROTECTION_RETRIES for safety
//************************************************************************************
void resetLoadProtectionAuto() {
  if (loadWasTripped) {
    // Check if we have delayed maximum retries (Hiccup Protection)
    if (protectionRetryCount < MAX_PROTECTION_RETRIES) {
      // Safe to reset
      loadWasTripped = false;
      loadProtectionActive = false;
      overcurrentCount = 0;

      // Clear any existing messages on LCD line 3
      lcd.setCursor(0, 3);
      lcd.print("                ");
      DEBUG_PRINTLN("Load protection auto-reset after 5 seconds");
    } else {
      // Critical Fault - Latch Off
      lcd.setCursor(0, 3);
      lcd.print("SHORT CKT FAULT!"); // Notify user
      DEBUG_PRINTLN("Critical Fault: Max load retries exceeded. Latching OFF.");
    }
  }
}

//************************************************************************************
// Handle Load Control Buttons: MODE toggle, LOAD queue, AUTO manual override
// Uses consistent button debounce for all buttons (250ms)
//************************************************************************************
void handleLoadButtons() {
  buttonMode.update();
  buttonLoad.update();

  // Consistent button debounce for all buttons
  static unsigned long lastButtonPress = 0;
  const unsigned long BUTTON_DEBOUNCE = 250; // Consistent 250ms debounce for all buttons

  // Toggle between AUTO and MANUAL load control modes
  if (buttonMode.fell()) {
    if (millis() - lastButtonPress < BUTTON_DEBOUNCE) return;
    lastButtonPress = millis();

    loadControlMode = (loadControlMode == AUTO) ?
                      MANUAL : AUTO;
    loadControlModeStr = (loadControlMode == AUTO) ?
                         "A" : "M";
    // Non-blocking beep to fix button lag
    startBeepPattern(1, 100, 50, BEEP_PRIORITY_NORMAL, true);

    persistLoadMode();
  }

  // Handle load on/off button press
  if (buttonLoad.fell()) {
    // Consistent debounce with MODE button
    if (millis() - lastButtonPress < BUTTON_DEBOUNCE) {
      return; // Ignore bounce
    }
    lastButtonPress = millis();
    // Manual Reset of Latched Fault
    if (protectionRetryCount >= MAX_PROTECTION_RETRIES) {
      // Reset Faults
      protectionRetryCount = 0;
      loadWasTripped = false;
      loadProtectionActive = false;
      overcurrentCount = 0;

