subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
      // Feedback
      lcd.setCursor(0, 3);
      lcd.print("     Reset      ");
      startBeepPattern(3, 80, 40, BEEP_PRIORITY_HIGH, true);
      DEBUG_PRINTLN("User manually reset load protection.");
      return;
    }

    // Normal Load Toggle Logic (Only works if NOT tripped)
    if (!loadWasTripped && !pendingLoadChange) {
      bool wantOn = !load_is_on;
      nextToggleIsManual = true;
      scheduleLoadToggle(wantOn);
    }
  }

  // Handle temporary load expiration in AUTO mode
  if (tempLoadOn && loadControlMode == AUTO) {
    unsigned long elapsed = millis() - tempLoadStart;
    if (!autoBeepPending && elapsed >= (TEMP_LOAD_DURATION - TEMP_OFF_WARN_LEAD_MS)) {
      autoBeepPending = true;
      startBeepPattern(AUTO_EXPIRY_BEEP_COUNT, AUTO_EXPIRY_BEEP_ON_MS, AUTO_EXPIRY_BEEP_OFF_MS, BEEP_PRIORITY_NORMAL);
    }
    if (elapsed >= TEMP_LOAD_DURATION) {
      tempLoadOn = false;
      autoBeepPending = false;
      digitalWrite(load_enable, LOW);
      load_is_on = false;
      load_status = "Off";
      lastLoadChangeTime = millis();
    }
  }

  // Execute pending load changes after beep pattern completion
  if (pendingLoadChange && !isBeepActive()) {
    finalizeLoadToggle();
  }
}

//************************************************************************************
// Manual Calibration Button Handler (Startup Only - 10 seconds)
// Allows calibration during initial startup phase only
//************************************************************************************
void handleCalibrationButton() {
  // Calibration button only works during startup phase (10 seconds)
  static bool startupPhase = true;
  static unsigned long startupTimeout = 10000; // 10 seconds startup window
  static unsigned long startTime = millis();
  // Disable calibration after startup timeout period
  if (millis() - startTime > startupTimeout) {
    startupPhase = false;
    return;
  }

  // Only allow calibration during startup phase
  if (!startupPhase) {
    return;
  }

  buttonCalibrate.update();

  if (buttonCalibrate.fell()) {
    DEBUG_PRINTLN("Manual calibration requested during startup");
    ensureBeep(150, 50); // Guaranteed beep for button press
    performCalibration();
    // Extend startup time after calibration to allow for completion
    startTime = millis();
  }
}

//************************************************************************************
// Watchdog Management Functions
// Ensures system stability by preventing hangs and crashes
//************************************************************************************
void initWatchdog() {
  // Initialize the Task Watchdog Timer
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t twdt_config = {
    .timeout_ms = WATCHDOG_TIMEOUT * 1000,
    .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, // Trigger on all cores
    .trigger_panic = true
  };
  esp_err_t err = esp_task_wdt_init(&twdt_config);
#else
  esp_err_t err = esp_task_wdt_init(WATCHDOG_TIMEOUT, true); // Enable panic so ESP32 restarts
#endif

  if (err != ESP_OK) {
    DEBUG_PRINTF("Failed to initialize watchdog: %d\n", err);
  } else {
    DEBUG_PRINTF("Watchdog initialized with %d second timeout\n", WATCHDOG_TIMEOUT);
  }

  // Add current task to watchdog
  err = esp_task_wdt_add(NULL);
  if (err != ESP_OK) {
    DEBUG_PRINTF("Failed to add task to watchdog: %d\n", err);
  } else {
    DEBUG_PRINTLN("Current task added to watchdog");
  }

  lastWatchdogFeed = millis();
}

void feedWatchdog() {
  // Feed the watchdog periodically to prevent reset
  if (millis() - lastWatchdogFeed >= WATCHDOG_FEED_INTERVAL) {
    esp_task_wdt_reset();
    lastWatchdogFeed = millis();
  }
}

void disableWatchdog() {
  // Disable watchdog before operations that might take longer than timeout
  esp_task_wdt_delete(NULL);
  DEBUG_PRINTLN("Watchdog disabled");
}

void reenableWatchdog() {
  // Re-enable watchdog after long operations
  esp_task_wdt_add(NULL);
  lastWatchdogFeed = millis();
  DEBUG_PRINTLN("Watchdog re-enabled");
}

//************************************************************************************
// I²C Bus Recovery Function
// Enhanced I²C bus recovery with proper clock pulse sequence and STOP condition
//************************************************************************************
void recoverI2CBus() {
  DEBUG_PRINTLN("I²C bus recovery initiated...");
  systemHealth.i2cRecoveries++; // Track recovery attempts

  // Release I²C pins
  Wire.end();
  delay(10);
  // Configure pins as GPIO
  pinMode(21, OUTPUT);  // SDA
  pinMode(22, OUTPUT);  // SCL

  // I²C bus recovery procedure (9 clock pulses with SDA high)
  for (int i = 0; i < 9; i++) {
    digitalWrite(22, LOW); // SCL low
    delayMicroseconds(5);
    digitalWrite(21, HIGH);   // Ensure SDA is released (HIGH)
    delayMicroseconds(5);
    digitalWrite(22, HIGH);   // SCL high
    delayMicroseconds(5);
    digitalWrite(22, LOW); // SCL low for next cycle
    delayMicroseconds(5);
  }

  // Create STOP condition (SCL high, then SDA high)
  digitalWrite(22, HIGH);
  delayMicroseconds(5);
  digitalWrite(21, HIGH);
  delayMicroseconds(5);
  // Return to I²C mode
  pinMode(21, INPUT_PULLUP);
  pinMode(22, INPUT_PULLUP);
  delay(50);

  // Reinitialize I²C
  Wire.begin(21, 22);
  Wire.setClock(200000);
  delay(100);
  DEBUG_PRINTLN("I²C bus recovery completed");
}

//************************************************************************************
// Estimate Battery Percentage (0-100%)
// Battery-Type-Specific Linear Mapping with smoothing for stable readings
//************************************************************************************
int getBatteryPercentage(float voltage) {
  float min_voltage, max_voltage;
  // Battery-type-specific voltage ranges for linear mapping
  switch (selectedBattery) {
    case LEAD_ACID_12V_7AH:
      // Lead Acid: 10.5V (discharged) to 12.7V (fully charged)
      min_voltage = 10.5f;
      max_voltage = 12.7f;
      break;

