subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
    case LIFEPO4_12V:
      // LiFePO4: 10.0V (discharged) to 13.8V (fully charged)
      min_voltage = 10.0f;
      max_voltage = 13.8f;
      break;
    case LIION_3S:
      // Li-ion: 9.0V (discharged) to 12.6V (fully charged)
      min_voltage = 9.0f;
      max_voltage = 12.6f;
      break;

    default:
      // Fallback to safe defaults
      min_voltage = MIN_BATTERY_VOLTAGE;
      max_voltage = MAX_BATTERY_VOLTAGE;
      break;
  }

  // Constrain voltage to prevent out-of-range calculations
  voltage = constrain(voltage, min_voltage, max_voltage);
  // Proper static variable initialization
  static float smoothedVoltage = 0.0f;
  static bool firstRun = true;
  const float SMOOTHING_FACTOR = 0.1;

  if (firstRun) {
    smoothedVoltage = voltage; // Use actual voltage on first run
    firstRun = false;
  } else {
    smoothedVoltage += (voltage - smoothedVoltage) * SMOOTHING_FACTOR;
  }

  // Division by zero safety check
  if (fabs(max_voltage - min_voltage) < 0.01) return 0;
  // Linear mapping: percentage = (voltage - min) / (max - min) * 100
  float percentage = ((smoothedVoltage - min_voltage) / (max_voltage - min_voltage)) * 100.0;
  // Return constrained and rounded percentage
  return round(constrain(percentage, 0.0, 100.0));
}

//************************************************************************************
// Non-blocking Welcome Screen with Delays
// Displays welcome message with version information
//************************************************************************************
void showWelcomeScreenNonBlocking() {
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("ESP32 CC/CV Charger");
  lcd.setCursor(2, 1); lcd.print("Controller v12.1");
  lcd.setCursor(6, 2); lcd.print("Dev By");
  lcd.setCursor(4, 3); lcd.print("Subash Saraf");

  playPowerOnBeep();
  waitForBeepPattern(200); // Non-blocking 2 second wait
  NonBlockingDelay welcomeDelay;
  unsigned long startTime = millis();
  while (millis() - startTime < 2000) {
    updateBeepPattern();
    feedWatchdog(); // Feed watchdog during initialization
    delay(10);
  }
}

//************************************************************************************
// System Health Monitoring and Memory Management
// Tracks system performance and detects potential issues
//************************************************************************************
void monitorSystemHealth() {
  static unsigned long lastHealthCheck = 0;
  unsigned long now = millis();

  // Check every 30 seconds
  if (now - lastHealthCheck > 30000) {
    lastHealthCheck = now;
    // Update system health metrics
    systemHealth.totalUptime = now / 1000; // Convert to seconds
    uint32_t freeHeap = ESP.getFreeHeap();
    uint32_t minFree = ESP.getMinFreeHeap();
    uint32_t maxAlloc = ESP.getMaxAllocHeap();
    // Track minimum free heap
    if (freeHeap < systemHealth.minFreeHeap) {
      systemHealth.minFreeHeap = freeHeap;
    }

    // Log memory status periodically
    DEBUG_PRINTF("[HEALTH] Uptime: %lus, Free Heap: %u, Min Free: %u, Max Alloc: %u\n",
                 systemHealth.totalUptime, freeHeap, minFree, maxAlloc);
    // Warning if heap is getting low
    if (freeHeap < 20000) {
      DEBUG_PRINTLN("[WARNING] Low heap memory detected!");
    }
  }
}

//************************************************************************************
// Graceful Shutdown Procedure
// Safely powers down system components before restart or shutdown
//************************************************************************************
void gracefulShutdown() {
  DEBUG_PRINTLN("Starting graceful shutdown...");
  // Turn off PWM output
  writePWMClamped(0);

  // Disable load
  digitalWrite(load_enable, LOW);
  // Turn off LEDs
  digitalWrite(LED_CRITICAL, LOW);
  digitalWrite(LED_MEDIUM, LOW);
  digitalWrite(LED_FULL, LOW);
  COMPAT_LEDC_WRITE(BATTSTATUS_LED, ledChannel, 0);

  // Explicitly ensure IR2104 is shutdown (High-Z)
  digitalWrite(DRIVER_SD_PIN, LOW);
  // Display shutdown message
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("Shutting down...");
  // Play shutdown beep
  ensureBeep(300, 150);
  delay(1000);
  // Turn off LCD backlight
  lcd.noBacklight();

  DEBUG_PRINTLN("Graceful shutdown completed");
}

//************************************************************************************
// Arduino Setup: Initialize Peripherals, WiFi, Sensors, PWM, UI
// Main initialization function called once at startup
//************************************************************************************
void setup() {
#if ENABLE_SERIAL_DEBUG
  Serial.begin(115200);
  // Version Check Print
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  DEBUG_PRINTLN("Core Version: v3.0+ (LEDC API Updated)");
#else
  DEBUG_PRINTLN("Core Version: v2.x (Legacy LEDC API)");
#endif
#endif

  // FIX: SIGNAL NOISE (Ground Bounce)
  WiFi.setSleep(false);
  // Initialize watchdog first
  initWatchdog();
  // FIX: I2C SPEED INCOMPATIBILITY (Logic Level Converter)
  Wire.begin(21, 22);
  Wire.setClock(200000);// 200kHz - 2x faster updates

  lcd.init();
  lcd.backlight();
  // Show welcome screen at startup
  setupBuzzer(); // Initialize Buzzer module

  showWelcomeScreenNonBlocking();

  pinMode(BUTTON_MODE, INPUT_PULLUP);
  buttonMode.attach(BUTTON_MODE);
  buttonMode.interval(50);
  pinMode(BUTTON_LOAD, INPUT_PULLUP);
  buttonLoad.attach(BUTTON_LOAD);
  buttonLoad.interval(50);

  pinMode(BUTTON_WIFI_RESET, INPUT_PULLUP);
  buttonWiFiReset.attach(BUTTON_WIFI_RESET);
  buttonWiFiReset.interval(50);
  pinMode(BUTTON_CALIBRATE, INPUT_PULLUP);
  buttonCalibrate.attach(BUTTON_CALIBRATE);
  buttonCalibrate.interval(50);

  buzzOff();

  playPowerOnBeep();
  waitForBeepPattern(600);

  // Use new wifi_sys module
  setupNetwork();

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("Searching for WiFi");
  DEBUG_PRINTLN("Searching for WiFi...");

  // Complete WiFi setup with services (moved to wifi_sys)
  bool wifiConnected = setupWiFiAndServices();
  // Continue with hardware initialization
  pinMode(load_enable, OUTPUT);
  digitalWrite(load_enable, LOW);
  pinMode(BATTSTATUS_LED, OUTPUT);
  pinMode(LED_CRITICAL, OUTPUT);
  digitalWrite(LED_CRITICAL, LOW);
  pinMode(LED_MEDIUM, OUTPUT);
  digitalWrite(LED_MEDIUM, LOW);
  pinMode(LED_FULL, OUTPUT);
  digitalWrite(LED_FULL, LOW);

  // === IR2104 INITIALIZATION ===
  // Initialize SD (Shutdown) pin to LOW (Drivers OFF)
  pinMode(DRIVER_SD_PIN, OUTPUT);
  digitalWrite(DRIVER_SD_PIN, LOW);

  restoreLoadMode();

  // PWM SAFE BOOT: Apply EXACT order - attach, write 0, delay
  digitalWrite(PWM_out, LOW);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(PWM_out, PWM_FREQ, PWM_RES);
#else
  ledcSetup(PWM_CHANNEL, PWM_FREQ, PWM_RES);
  ledcAttachPin(PWM_out, PWM_CHANNEL);
#endif
  ledcWrite(PWM_out, 0);
  delay(1);

