subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
  // REMOVED: writePWMClamped(pwm_value) - PWM is written ONLY in control logic
  Auto_Reboot_Logic();
  // Run sensors and logic every 100ms to reduce blocking latency
  if (sensorDelay.isComplete(100)) {
    readSensors();
    // CHECK LOAD PROTECTION AFTER READING SENSORS
    checkLoadProtection();
    updateChargeMode();

    // CRITICAL FIX: Call adjustPWM() for active charging modes
    // This ensures PWM is actively controlled regardless of state transitions
    if (mode != BACKUP && mode != IDLE) {
      // Determine target voltage and current based on mode
      float targetVoltage, maxCurrent;
      switch (mode) {
        case BULK:
          targetVoltage = min(bulk_voltage_max, BULK_SAFETY_LIMIT);
          maxCurrent = currentBattery.bulk_current;
          break;
        case ABSORPTION:
          targetVoltage = absorption_voltage_max;
          maxCurrent = currentBattery.absorption_current;
          break;
        case FLOAT:
          targetVoltage = min(float_voltage_max, FLOAT_SAFETY_LIMIT);
          maxCurrent = currentBattery.float_current;
          break;
        default:
          targetVoltage = min(bulk_voltage_max, BULK_SAFETY_LIMIT);
          maxCurrent = currentBattery.bulk_current;
          break;
      }
      adjustPWM(targetVoltage, maxCurrent);
    }

    // Manage Driver SD (Shutdown) pin state
    manageDriverSD();
    updateLoadStatus();
  }

  // Update LCD every 500ms
  if (lcdDelay.isComplete(500)) {
    Update_Main_LCD();
  }

  BattStatusLED_Pulse();
  updateBatteryStatusLED();
  SPINNER_Status();
  Battery_Power_Display();
  // Log data every 1 second
  if (logDelay.isComplete(1000)) {
    logDataToSerial();
  }

  // Monitor system health
  monitorSystemHealth();

  updateFanPWM(temperatureC);
  // Small yield delay to prevent issues in tight loops
  delay(1);
}

//************************************************************************************
// Auto Reboot with 30s Heads-up on LCD
// Automatic system reboot every 24 hours for stability
//************************************************************************************
void Auto_Reboot_Logic() {
  static bool counting = false;
  static unsigned long countdownStart = 0;
  static NonBlockingDelay rebootDelay;

  unsigned long uptime = millis() - rebootStartTime;
  if (!counting && uptime >= REBOOT_INTERVAL - 30000UL) {
    counting = true;
    rebootNotified = true;
    countdownStart = millis();
    DEBUG_PRINTLN("Rebooting system...in 30 Sec");
  }

  if (counting) {
    if (rebootDelay.isComplete(1000)) { // Update every second
      unsigned long elapsed = millis() - countdownStart;
      int remaining = 30 - (elapsed / 1000);
      if (remaining < 0) remaining = 0;

      lcd.setCursor(0, 3);
      lcd.print("Rebooting in " + String(remaining) + "s        ");

      if (elapsed >= 30000UL) {
        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("Rebooting system...");
        DEBUG_PRINTLN("Rebooting now...");
        // Give time for LCD update before reboot
        delay(1000);
        ESP.restart();
      }
    }
  }
}

//************************************************************************************
// Read Sensors (ADS1115 + DS18B20)
// Enhanced with hysteresis for current noise filtering
// Enhanced temperature sensor validation with rate-of-change limits
//************************************************************************************
void readSensors() {
  //************************************************************************************

  ////LiFePO₄ – No Input  simulation
  ////Use this to test BACKUP Mode :
#if SIMULATION_MODE
  input_voltage = 0.0;     // Stable DC supply present
  bat_voltage   = 14.40;    // Near LiFePO4 absorption voltage (14.4V)
  Current_A     = 0.02;     // Very low current (20 mA)
  temperatureC  = 32.0;
  tempValid     = true;
  return;
#endif

  //************************************************************************************

  ////LiFePO₄ – BULK simulation
  ////Use this to test BULK → ABSORPTION:
  //#if SIMULATION_MODE
  //  input_voltage = 24.0;      // Input OK
  //  bat_voltage   = 14.75;     // MUST be >= 14.70 (14.6 + hysteresis)
  //  Current_A     = 1.0;       // High current (still charging)
  //  temperatureC = 32.0;
  //  tempValid    = true;
  //  return;
  //#endif

  //************************************************************************************

  ////LiFePO₄ – ABSORPTION simulation
  ////Use this to test ABS → IDLE logic:
  //
  //#if SIMULATION_MODE
  //  input_voltage = 24.0;
  //  bat_voltage   = 14.75;
  //  Current_A     = 0.02;    // Low current
  //  temperatureC = 32.0;
  //  tempValid    = true;
  //  return;
  //#endif

  //************************************************************************************



  // Read DC input voltage from defined channel
  int16_t raw_input = ads.readADC_SingleEnded(ADS_PIN_INPUT_VOLTAGE);
  float adc_input_V = ads.computeVolts(raw_input);
  float new_input = adc_input_V * dividerFactor;
  // Read battery voltage from defined channel
  int16_t raw_batt = ads.readADC_SingleEnded(ADS_PIN_BATTERY_VOLTAGE);
  float adc_batt_V = ads.computeVolts(raw_batt);
  float new_batt = adc_batt_V * dividerFactor;

  // Apply filtering
  input_voltage = ALPHA_V * new_input + (1 - ALPHA_V) * input_voltage;
  bat_voltage   = ALPHA_V * new_batt  + (1 - ALPHA_V) * bat_voltage;
  // Read current from ACS712 sensor on defined channel
  int16_t raw_I = ads.readADC_SingleEnded(ADS_PIN_CURRENT_SENSOR);
  float v2 = ads.computeVolts(raw_I);
  float current = (v2 - ACS_OFFSET_VOLTAGE) / ACS_SENSITIVITY;
  current += MANUAL_OFFSET_CORRECTION;
  if (current < 0) current = -current;
  // Add hysteresis for noise filtering
  static float lastFilteredCurrent = 0.0f;
  if (fabs(current) < noiseThreshold + NOISE_HYSTERESIS &&
      fabs(lastFilteredCurrent) < noiseThreshold + NOISE_HYSTERESIS) {
    current = 0.0f;
  }
  lastFilteredCurrent = current;

