subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
  Current_A = ALPHA_C * current + (1 - ALPHA_C) * Current_A;
  // Temperature sensor reading with enhanced validation
  if (ds18b20Found) {
    if (ds18b20.isConversionComplete()) {
      float tC = ds18b20.getTempC(ds18b20Addr);
      // Temperature validation with rate-of-change limits
      static float lastValidTemp = 25.0f;
      static unsigned long lastTempRead = 0;
      const float MAX_TEMP_RATE_CHANGE = 5.0f; // Max 5°C per second

      if (tC != DEVICE_DISCONNECTED_C && tC > -55.0f && tC < 125.0f) {
        unsigned long now = millis();
        float timeDelta = (now - lastTempRead) / 1000.0f; // Convert to seconds

        // Check for sudden unrealistic changes
        if (timeDelta > 0 && fabs(tC - lastValidTemp) / timeDelta <= MAX_TEMP_RATE_CHANGE) {
          tempValid = true;
          filteredTemp = ALPHA_TEMP * tC + (1.0f - ALPHA_TEMP) * filteredTemp;
          temperatureC = filteredTemp;
          lastValidTemp = tC;
          lastTempRead = now;
        } else {
          // Use filtered value if rate is too high
          temperatureC = filteredTemp;
          tempValid = false;
        }
      } else {
        // Reset filtered temperature on invalid read
        filteredTemp = lastValidTemp; // Keep last known good value
        temperatureC = filteredTemp;
        tempValid = false;
      }
      ds18b20.requestTemperatures();
    }
  } else {
    tempValid = false;
  }
}

//************************************************************************************
// Charge Mode State Machine - v12.1 FULL HYSTERESIS-BASED CONTROLLER
// Implements complete state transitions: BULK → ABSORPTION → FLOAT → BACKUP → IDLE → BULK
// Strict separation: Only handles state transitions, timers, and hysteresis decisions
// All hysteresis values sourced from battery_types.h (no magic numbers)
//************************************************************************************
void updateChargeMode() {
  static unsigned long floatHoldStart = 0UL;
  static unsigned long absorptionHoldStart = 0UL;
  static unsigned long overvoltageStart = 0UL;
  static unsigned long idleStartTime = 0UL;
  static unsigned long idleVoltageDropStart = 0UL;

  //************************************************************************************
  // Sync internal timers to globals for logging visibility
  //************************************************************************************
  g_absorptionHoldStart  = absorptionHoldStart;
  g_floatHoldStart       = floatHoldStart;
  g_idleVoltageDropStart = idleVoltageDropStart;

  unsigned long now = millis();

  // MODE FLAPPING PREVENTION: Enforce minimum dwell time
  bool canTransition = (now - lastModeChange >= currentBattery.min_mode_time_ms);

  // === IR2104 CHANGE ===
  // When resetting PWM, ensure we respect the synchronous topology.
  // 0 = Low-Side ON (Freewheeling) via Driver.

  // Check if input voltage is sufficient for charging
  if (input_voltage <= input_voltage_min) {
    if (mode != BACKUP) {
      mode = BACKUP;
      // Show (BATT) when load is ON, (B-IDL) when load is OFF
      mode_str = (load_is_on && !loadWasTripped) ? "(BATT)" : "(B-IDL)";
      // Full Reset
      pwm_value = 0; pwm_last = 0; writePWMClamped(pwm_value);
      lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleStartTime = 0; idleVoltageDropStart = 0;
      DEBUG_PRINTLN(F("Entering BACKUP mode due to low input voltage"));
    } else {
      // Already in BACKUP mode - update display based on current load status
      mode_str = (load_is_on && !loadWasTripped) ? "(BATT)" : "(B-IDL)";
    }
    return;
  }

  // Exit BACKUP when input voltage is restored
  if (mode == BACKUP && input_voltage > input_voltage_min) {
    mode = BULK;
    mode_str = "(BULK)";
    // Full Reset for Soft Start
    pwm_value = 0; pwm_last = 0; writePWMClamped(0);
    lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleStartTime = 0; idleVoltageDropStart = 0;
    DEBUG_PRINTLN(F("Exiting BACKUP -> Restarting from BULK"));
    return;
  }

  // Overvoltage protection - FORCE BACKUP with hard PWM shutdown
  if (bat_voltage >= OVERVOLTAGE_CUTOFF) {
    if (overvoltageStart == 0) overvoltageStart = now;
    if (now - overvoltageStart < 3000) {
      // Rapid PWM reduction during overvoltage
      pwm_value = max(pwm_value - 30, 0); // Increased step for 10-bit range
      writePWMClamped(pwm_value);
      DEBUG_PRINTLN(F("Overvoltage! Reducing PWM..."));
    } else {
      // Persistent overvoltage - force BACKUP
      mode = BACKUP;
      // Show (B-IDL) during overvoltage (safety state, load should be OFF)
      mode_str = "(B-IDL)";
      pwm_value = 0;
      pwm_last = 0;
      writePWMClamped(pwm_value);
      lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleVoltageDropStart = 0;
      DEBUG_PRINTLN(F("Overvoltage persists -> Switching to BACKUP!"));
    }
    return;
  } else {
    overvoltageStart = 0;
  }

  // IDLE mode entry (battery fully charged) - FIXED: Only from FLOAT mode
  if (mode == FLOAT && canTransition) {
    // Battery must be at float voltage with low current to enter IDLE
    bool atFloatVoltage = (bat_voltage >= (float_voltage_min - VOLTAGE_HYSTERESIS)) &&
                          (bat_voltage <= (float_voltage_max + VOLTAGE_HYSTERESIS));
    bool lowCurrent = (Current_A <= IDLE_CURRENT_THRESHOLD);

    if (atFloatVoltage && lowCurrent) {
      if (idleStartTime == 0) idleStartTime = now;
      // Use battery-specific idle entry time
      if ((now - idleStartTime) >= currentBattery.idle_entry_time_ms) {
        mode = IDLE;
        mode_str = "(IDLE)";
        pwm_value = 0; pwm_last = 0; writePWMClamped(0);
        lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleVoltageDropStart = 0;
        DEBUG_PRINTLN(F("Entering IDLE mode (battery fully charged)"));
        return;
      }
    } else {
      idleStartTime = 0; // Reset timer if conditions no longer met
    }
  } else if (mode != IDLE) {
    idleStartTime = 0; // Reset timer if not in FLOAT mode
  }

  // IDLE mode management - requires voltage + time hysteresis to exit
  if (mode == IDLE) {
    if (bat_voltage <= (float_voltage_min - VOLTAGE_HYSTERESIS)) {
      if (idleVoltageDropStart == 0) idleVoltageDropStart = now;
      // Use battery-specific idle exit time
      if ((now - idleVoltageDropStart) >= currentBattery.idle_exit_time_ms) {
        mode = BULK;
        mode_str = "(BULK)";
        lastModeChange = now;
        idleStartTime = 0;
        idleVoltageDropStart = 0;
        floatHoldStart = 0;
        absorptionHoldStart = 0;
        DEBUG_PRINTLN(F("IDLE -> BULK: Battery voltage low for specified time"));
        return;
      }
    } else {
      idleVoltageDropStart = 0;
    }

    if (Current_A > (IDLE_CURRENT_THRESHOLD + CURRENT_HYSTERESIS)) {
      mode = BULK;
      mode_str = "(BULK)";
      lastModeChange = now;
      idleStartTime = 0;
      idleVoltageDropStart = 0;
      floatHoldStart = 0;
      absorptionHoldStart = 0;
      DEBUG_PRINTLN(F("Exiting IDLE mode (current increased)"));
      return;
    }

    pwm_value = 0; pwm_last = 0; writePWMClamped(0);
    return;
  }

