subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
  // MAIN STATE TRANSITIONS
  switch (mode) {
    case BULK:
      if (canTransition) {
        bool reachedV = (bat_voltage >= (bulk_voltage_max + VOLTAGE_HYSTERESIS));
        if (reachedV) {
          mode = ABSORPTION;
          mode_str = "(ABSO)";
          lastModeChange = now;
          floatHoldStart = 0;
          absorptionHoldStart = 0;
          DEBUG_PRINTLN(F("Transition: BULK -> ABSORPTION"));
        }
      }
      break;

    case ABSORPTION:
      if (canTransition) {
        if (absorptionHoldStart == 0) {
          absorptionHoldStart = now;
          DEBUG_PRINTLN(F("Absorption timer started"));
        }

        bool timerElapsed =
          (now - absorptionHoldStart >= currentBattery.absorption_time_ms);

        bool currentLow =
          (Current_A <= IDLE_CURRENT_THRESHOLD);

        if (timerElapsed || currentLow) {
          mode = IDLE;
          mode_str = "(IDLE)";
          pwm_value = 0;
          pwm_last  = 0;
          writePWMClamped(0);
          lastModeChange = now;
          absorptionHoldStart = 0;
          DEBUG_PRINTLN(F("ABSORPTION -> IDLE (LiFePO4)"));
        }
      }
      break;


    case FLOAT:
      if (canTransition) {
        // SAFE FLOAT EXIT: Requires voltage drop below min with hysteresis
        bool lowV = (bat_voltage < (float_voltage_min - VOLTAGE_HYSTERESIS));
        bool highI = (Current_A > (currentBattery.float_current + CURRENT_HYSTERESIS));
        if (lowV || highI) {
          if (floatHoldStart == 0) {
            floatHoldStart = now;
            DEBUG_PRINTLN(F("Float exit timer started (V or I out of range)"));
          } else if (now - floatHoldStart >= currentBattery.float_exit_time_ms) {
            // Use battery-specific float exit time
            mode = BULK;
            mode_str = "(BULK)";
            lastModeChange = now;
            floatHoldStart = 0;
            absorptionHoldStart = 0;
            DEBUG_PRINTLN(F("Transition: FLOAT -> BULK"));
          }
        } else {
          floatHoldStart = 0;
        }
      }
      break;
    default:
      break;
  }
}
//************************************************************************************
// Adjust PWM Based on Voltage/Current Error (CC/CV Algorithm)
// Fixed-step control for stability with noisy ADC and inductive components
// All hysteresis values sourced from battery_types.h (no magic numbers)
//************************************************************************************
void adjustPWM(float targetVoltage, float maxCurrent) {
  if (mode == BACKUP || mode == IDLE) {
    pwm_value = 0;
    pwm_last = 0;
    writePWMClamped(pwm_value);
    return;
  }

  // SOFT-START RE-TRIGGER PREVENTION: Execute only once per charge cycle
  static bool softStartDone = false;
  if (mode == BACKUP || mode == IDLE) {
    softStartDone = false;
  }

  // CURRENT-QUALIFIED SOFT START: Don't ramp unless current is flowing
  const float SOFTSTART_MIN_CURRENT = 0.01f; // Lower to 10mA for smoother startup
  if (!softStartDone && Current_A < SOFTSTART_MIN_CURRENT) {
    // Don't start soft-start unless we see some current
    pwm_value = 20;
    pwm_last  = 20;
    writePWMClamped(20);   // allow tiny PWM to detect current
    return;
  }
  softStartDone = true;

  // Surge current protection with timing control
  unsigned long now = millis();
  if (now - lastPWMChange < MIN_PWM_CHANGE_INTERVAL) {
    return; // Skip PWM update too soon
  }

  // Rate limiting based on current
  const float currentRampRate = 0.8f; // Slower ramp rate for stability
  float maxDeltaCurrent = currentRampRate * (MIN_PWM_CHANGE_INTERVAL / 1000.0f);
  if (fabs(Current_A - lastCurrent) > maxDeltaCurrent) {
    // Current changing too fast - limit PWM change
    int maxPWMDelta = 2; // HALVED: 2 instead of 4
    if (pwm_value > lastPWMValue) {
      pwm_value = min(lastPWMValue + maxPWMDelta, pwm_value);
    } else {
      pwm_value = max(lastPWMValue - maxPWMDelta, pwm_value);
    }
  }

  lastCurrent = Current_A;
  lastPWMValue = pwm_value;
  lastPWMChange = now;

  // === IR2104 CHANGE ===
  // ANTI-COLLAPSE PROTECTION
  // In a Synchronous Buck, if Input < Bat, we must NOT switch,
  // otherwise we might boost current backwards from Bat to Input
  // (depending on diode configuration).
  // Force OFF if input headroom is gone.
  //  if (input_voltage < (bat_voltage + 0.5f)) { // Tightened threshold
  //    pwm_value = 0; // Force Low-Side ON (Freewheel/Block)

  if (input_voltage < (bat_voltage + 1.5f)) { // Looser threshold
    pwm_value = max(pwm_value - 20, 0); // Gradual reduction instead of hard cutoff


    pwm_last = 0;
    writePWMClamped(pwm_value);
    return;
  }

  // Detect if we are close to collapsing to inhibit aggressive PWM increases
  bool nearCollapse = (input_voltage < (bat_voltage + 2.0));

  // MODE-SPECIFIC ABSOLUTE VOLTAGE SAFETY: Use correct safety limit based on mode
  float currentSafetyLimit = BULK_SAFETY_LIMIT;
  if (mode == FLOAT) {
    currentSafetyLimit = FLOAT_SAFETY_LIMIT;
  }

  // SAFETY OVERRIDE ENFORCEMENT: Check absolute maximum limits
  if (bat_voltage > currentSafetyLimit || Current_A > maxCurrent * 1.5f) {
    // Safety violation - reduce PWM aggressively and freeze PWM increase
    pwm_value = max(pwm_value - 30, 0);
    writePWMClamped(pwm_value);
    return; // Freeze PWM increase while safety violation exists
  }

  // === IR2104 CHANGE ===
  // Updated Control Limit to user-defined percentage
  const int SAFETY_MAX_PWM = PWM_MAX_DUTY;

  // FIXED-STEP CONTROL: Small fixed steps for stability (no magic numbers)
  const int PWM_STEP_UP = 1;      // HALVED: 1 instead of 8 (0.1% of full scale)
  const int PWM_STEP_DOWN = 2;    // HALVED: 2 instead of 4 (0.2% of full scale)
  const int PWM_STEP_SAFETY = 64; // Large step for safety violations (6.3% of full scale)

  // FIXED-STEP LOGIC: Determine if we need more or less power
  bool need_more_power = false;
  bool need_less_power = false;

  if (mode == BULK) {
    // CONSTANT CURRENT MODE: Target is current, not voltage
    float currentError = maxCurrent - Current_A;

    if (currentError > 0.2f) {
      // Need more current - increase PWM with fixed step
      need_more_power = true;
    } else if (currentError < -0.1f) {
      // Need less current - decrease PWM with fixed step
      need_less_power = true;
    }

    // Voltage ceiling check for CC mode
    if (bat_voltage > bulk_voltage_max) {
      need_less_power = true; // Voltage too high in CC mode
    }

  } else {
    // CONSTANT VOLTAGE MODE (Absorption/Float): Target is voltage
    float voltageError = targetVoltage - bat_voltage;

    if (voltageError > 0.1f) {
      // Voltage below target - increase PWM with fixed step
      need_more_power = true;
    } else if (voltageError < -0.05f) {
      // Voltage above target - decrease PWM with fixed step
      need_less_power = true;
    }

