subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
    // Current ceiling in CV mode
    if (Current_A > maxCurrent) {
      need_less_power = true; // Current too high in CV mode
    }
  }

  // FIXED-STEP EXECUTION: Apply small fixed steps
  if (need_more_power) {
    pwm_value += PWM_STEP_UP;      // small fixed step up
    // Only log if PWM is actually changing
    if (pwm_value > 0) {
      DEBUG_PRINTF("Fixed-step: Need more power. PWM: %d\n", pwm_value);
    }
  }
  else if (need_less_power) {
    // Suppress log spam when PWM is already at 0
    if (pwm_value > 0) {
      pwm_value -= PWM_STEP_DOWN;    // small fixed step down
      DEBUG_PRINTF("Fixed-step: Need less power. PWM: %d\n", pwm_value);
    }
    // If PWM is already 0, don't log and don't try to decrement further
  }

  // Smooth limiting using global pwm_last (The ramping controller)
  int delta = pwm_value - pwm_last;
  if (delta > 16) { // Scaled x4
    pwm_value = pwm_last + 16; // Absolute safety cap on rate of rise
  } else if (delta < -16) { // Scaled x4
    pwm_value = pwm_last - 16;
  }

  // === IR2104 CHANGE ===
  // Ensure the control variable never exceeds the user-defined limit
  pwm_value = constrain(pwm_value, 0, SAFETY_MAX_PWM);
  pwm_last = pwm_value;
  writePWMClamped(pwm_value);
}



//************************************************************************************
// Load Control Policy (AUTO mode)
// Simple rule ONLY:
// - Input power removed (below input_voltage_min) → LOAD ON
// - Input power present → LOAD OFF
// Battery low, overload, debounce logic preserved
//************************************************************************************
void updateLoadStatus() {

  if (loadControlMode != AUTO) {
    if (pendingLoadChange) finalizeLoadToggle();
    return;
  }

  if (tempLoadOn) {
    if (pendingLoadChange) finalizeLoadToggle();
    return;
  }

  unsigned long now = millis();

  if ((now - lastLoadChangeTime) >= debounceDelay &&
      !pendingLoadChange &&
      !loadWasTripped) {

    // Detect input power
    bool inputMissing = (input_voltage < input_voltage_min);

    // Battery safety
    bool battSafeOn    = (bat_voltage >= (battery_voltage_hysteresis + battery_voltage_min));
    bool battTooLowOff = (bat_voltage <  (battery_voltage_min - battery_voltage_hysteresis));

    // FINAL LOAD DECISION (ONLY input based)
    bool shouldTurnOnLoad  = (!load_is_on && inputMissing && battSafeOn);
    bool shouldTurnOffLoad = ( load_is_on && (!inputMissing || battTooLowOff) );

    if (shouldTurnOnLoad || shouldTurnOffLoad) {
      nextToggleIsManual = false;
      scheduleLoadToggle(shouldTurnOnLoad);
    }
  }

  if (pendingLoadChange) finalizeLoadToggle();
}



//************************************************************************************
// Breathing LED (Maps Brightness/Pulse Speed to Voltage)
// Enhanced algorithm with smoother animation using sine wave modulation
//************************************************************************************
void BattStatusLED_Pulse() {
  static unsigned long lastPulseUpdate = 0;
  static float pulsePhase = 0.0;
  unsigned long now = millis();
  // Update every 25ms for smoother animation
  if (now - lastPulseUpdate < 25) return;
  lastPulseUpdate = now;

  // Convert battery voltage to millivolts for processing
  int voltage_mV = bat_voltage * 1000;
  // Turn off LED for critically low voltage
  if (voltage_mV <= 8500) {
    // Use compatibility macro for v3.0+ support
    COMPAT_LEDC_WRITE(BATTSTATUS_LED, ledChannel, 0);
    return;
  }

  // Full brightness for very high voltage
  if (voltage_mV > 13700) {
    // Use compatibility macro for v3.0+ support
    COMPAT_LEDC_WRITE(BATTSTATUS_LED, ledChannel, 255);
    return;
  }

  // Constrain voltage to operational range
  voltage_mV = constrain(voltage_mV, 8000, 14000);
  // Calculate voltage ratio for dynamic behavior
  float voltageRatio = (voltage_mV - 8000) / float(14000 - 8000);
  // Dynamic brightness range based on voltage
  int brightnessMax = 180 + voltageRatio * (255 - 180); // 180-255 range
  int baseBrightness = 10;  // Minimum brightness to avoid complete darkness
  int pulseAmplitude = brightnessMax - baseBrightness;
  // Variable pulse speed - higher voltage = faster pulse
  float speedFactor = 0.015 + voltageRatio * 0.045; // 0.015-0.06 range
  pulsePhase += speedFactor;
  if (pulsePhase > TWO_PI) pulsePhase -= TWO_PI;
  // Sine wave modulation for smooth breathing effect
  float sineValue = (sin(pulsePhase) + 1.0) / 2.0;
  int pwmValue = baseBrightness + sineValue * pulseAmplitude;

  // Apply PWM to breathing LED using compatibility macro
  COMPAT_LEDC_WRITE(BATTSTATUS_LED, ledChannel, pwmValue);
}

//************************************************************************************
// Update Battery Status LEDs and LCD Display
// Uses battery-type-specific thresholds for accurate LED indication
//************************************************************************************
void updateBatteryStatusLED() {
  const int pct = constrain(getBatteryPercentage(bat_voltage), 0, 100);
  // Determine battery-type-specific thresholds for LED indication
  int crit_threshold, warn_threshold, good_threshold;
  switch (selectedBattery) {
    case LEAD_ACID_12V_7AH:
      crit_threshold = 20; // 20% for Lead Acid
      warn_threshold = 50; // 50% for Lead Acid
      good_threshold = 95; // 95% for Lead Acid
      break;

    case LIFEPO4_12V:
      crit_threshold = 10; // 10% for LiFePO4 (more aggressive protection)
      warn_threshold = 30; // 30% for LiFePO4
      good_threshold = 90; // 90% for LiFePO4
      break;

    case LIION_3S:
      crit_threshold = 15; // 15% for Li-ion (aggressive protection)
      warn_threshold = 25; // 25% for Li-ion
      good_threshold = 85; // 85% for Li-ion
      break;

    default:
      crit_threshold = 20;
      warn_threshold = 50;
      good_threshold = 95;
      break;
  }

  const bool critByVoltage = (bat_voltage <= (battery_voltage_min + CRIT_BATT_WARN_MARGIN));
  const bool critical = critByVoltage || (pct <= crit_threshold);

  bool criticalOn = false;
  bool mediumOn = false;
  bool fullOn = false;
  bool criticalFlash = false;
  bool mediumFlash = false;
  bool fullFlash = false;

  if (pct <= crit_threshold) {
    criticalOn = true;
    criticalFlash = true;
  } else if (pct <= warn_threshold) {
    criticalOn = true;
    mediumOn = true;
    mediumFlash = true;
  } else if (pct <= good_threshold) {
    criticalOn = true;
    mediumOn = true;
    fullOn = true;
    fullFlash = true;
  } else {
    criticalOn = true;
    mediumOn = true;
    fullOn = true;
  }

  static unsigned long lastFlashMillis = 0;
  const unsigned long FLASH_CYCLE_MS = 2000UL;
  const unsigned long FLASH_ON_DURATION_MS = 1000UL;
  const unsigned long now = millis();
  unsigned long elapsed = now - lastFlashMillis;

  bool shouldToggle = (elapsed >= FLASH_CYCLE_MS);
  if (shouldToggle) {
    lastFlashMillis = now;
  }

  bool flashState = (elapsed < FLASH_ON_DURATION_MS);
  digitalWrite(LED_CRITICAL, criticalOn && (!criticalFlash || flashState) ? HIGH : LOW);
  digitalWrite(LED_MEDIUM,   mediumOn && (!mediumFlash || flashState) ? HIGH : LOW);
  digitalWrite(LED_FULL,     fullOn && (!fullFlash || flashState) ? HIGH : LOW);

  const char* statusText;
  if (pct <= crit_threshold) {
    statusText = "{Crit}";
  } else if (pct <= warn_threshold) {
    statusText = "{Warn}";
  } else if (pct <= good_threshold) {
    statusText = "{Good}";
  } else {
    statusText = "{Full}";
  }

  lcd.setCursor(7, 2);
  lcd.print(statusText);
  int pad = 8 - strlen(statusText);
  while (pad-- > 0) lcd.print(' ');

  static bool wasCritical = false;
  static unsigned long lastBuzzerMillis = 0;
  const unsigned long CRIT_BEEP_PERIOD_MS = 60000UL;

  if (pct <= crit_threshold) {
    if (!wasCritical || (now - lastBuzzerMillis >= CRIT_BEEP_PERIOD_MS)) {
      playCriticalBeep();
      lastBuzzerMillis = now;
    }
  }

