subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
  wasCritical = (pct <= crit_threshold);
}

//************************************************************************************
// LCD Update (Throttled)
// Updates display with system status information using proper battery voltage mapping
// Uses battery-type-specific voltage ranges for accurate icon display
// Includes division by zero guard for duty calculation
//************************************************************************************
void Update_Main_LCD() {
  // Throttle LCD updates to prevent flickering and reduce processing overhead
  if (millis() - last_lcd_update < LCD_REFRESH_RATE_MS) return;
  last_lcd_update = millis();

  // Map battery voltage to icon index (0-5) using battery-type-specific range
  int battLevelIndex;
  float min_volt, max_volt;
  switch (selectedBattery) {
    case LEAD_ACID_12V_7AH:
      min_volt = 10.5f;
      max_volt = 12.7f;
      break;
    case LIFEPO4_12V:
      min_volt = 10.0f;
      max_volt = 13.5f;
      break;
    case LIION_3S:
      min_volt = 9.0f;
      max_volt = 12.6f;
      break;
    default:
      min_volt = MIN_BATTERY_VOLTAGE;
      max_volt = MAX_BATTERY_VOLTAGE;
      break;
  }

  battLevelIndex = (int)((bat_voltage - min_volt) * 5.0 / (max_volt - min_volt));
  battLevelIndex = constrain(battLevelIndex, 0, 5);

  // Display battery level icon in top right corner
  lcd.setCursor(11, 0); lcd.write(battLevelIndex);
  // Display temperature with degree symbol in top right corner
  lcd.setCursor(15, 0);
  if (tempValid) {
    int roundedTemp = round(temperatureC);
    lcd.print(roundedTemp);
  } else {
    lcd.print("--");
  }
  lcd.write(223); // Degree symbol (°)

  // Display power or battery icon based on input voltage availability
  lcd.setCursor(0, 2);
  if (input_voltage <= input_voltage_min) {
    // Low input voltage - show battery icon
    lcd.write(battLevelIndex);
    if (!rebootNotified) {
      lcd.setCursor(0, 3);
      lcd.write(battLevelIndex);
    }
  } else {
    // Adequate input voltage - show power icon
    lcd.write(POWER_ICON);
    if (!rebootNotified) {
      lcd.setCursor(0, 3);
      lcd.write(POWER_ICON);
    }
  }

  // Display input and battery voltages with 2 decimal places
  lcd.setCursor(0, 1);
  lcd.print(input_voltage, 2);
  lcd.print("v ");
  lcd.setCursor(7, 1); lcd.print(bat_voltage, 2); lcd.print("v    ");
  // === IR2104 CHANGE ===
  // Display % relative to the user-defined safety limit (PWM_MAX_DUTY)
  // User sees 100% when system is at max allowed power (user-defined %)
  int maxDuty = PWM_MAX_DUTY;
  // Division by zero guard with proper implementation
  int dutyPct = 0;
  if (maxDuty > 0) {
    dutyPct = (pwm_value * 100) / maxDuty;
    dutyPct = constrain(dutyPct, 0, 100); // Ensure within bounds
  }

  lcd.setCursor(15, 1);
  lcd.print("   "); // Fixed-width clear

  // Display PWM duty percentage
  lcd.setCursor(15, 1);
  lcd.print(dutyPct);
  lcd.print("%");
  // Display current in amps (A) or milliamps (mA) based on magnitude
  lcd.setCursor(1, 2);
  if (Current_A >= 1.0) {
    lcd.print(Current_A, 2);
    lcd.print("A ");
  } else {
    lcd.print(Current_A * 1000, 0);
    lcd.print("mA ");
  }

  // Display battery percentage and battery level icon using battery-type-specific calculation
  lcd.setCursor(15, 2); lcd.print(getBatteryPercentage(bat_voltage)); lcd.print("% ");
  lcd.setCursor(19, 2); lcd.write(battLevelIndex);

  // Toggle mode visibility every second for flashing effect
  if (millis() - last_flash_update >= 1000) {
    last_flash_update = millis();
    mode_visible = !mode_visible;
  }

  // Display WiFi connection status with blinking indicator when connected
  {
    static unsigned long lastWiFiBlink = 0;
    static bool wifiBlink = false;
    if (WiFi.status() == WL_CONNECTED) {
      // Blink WiFi indicator every 400ms when connected
      if (millis() - lastWiFiBlink >= 400) {
        lastWiFiBlink = millis();
        wifiBlink = !wifiBlink;
      }
      lcd.setCursor(13, 0); lcd.print(wifiBlink ? "!" : " ");
    } else {
      // Clear WiFi indicator when disconnected
      lcd.setCursor(13, 0);
      lcd.print(" ");
    }
  }

  // Display mode, load status, and control mode on bottom line (unless reboot countdown active)
  if (!rebootNotified) {
    lcd.setCursor(7, 3);
    // Flash mode string on/off for visibility
    if (mode_visible) lcd.print(mode_str);
    else lcd.print("        ");
    lcd.setCursor(15, 3);
    if (loadWasTripped) {
      lcd.print("off");
    } else {
      lcd.print(load_status);
    }
    lcd.setCursor(19, 3);
    if (loadProtectionEnabled && loadWasTripped) {
      lcd.print("P"); // Protection active/tripped
    } else {
      lcd.print(loadControlModeStr);
    }
  }
}

//************************************************************************************
// Spinner (Visual Activity Indicator)
// Provides visual feedback of system activity
//************************************************************************************
void SPINNER_C() {
  static uint8_t index = 0;
  const char spinner_chars[] = { '*', '*', '*', ' ', ' ' };
  lcd.setCursor(12, 0); lcd.print(spinner_chars[index++ % sizeof(spinner_chars)]);
}
void SPINNER_X() {
  static uint8_t index = 0;
  const char spinner_chars[] = { 'X', 'X', 'X', ' ', ' ' };
  lcd.setCursor(12, 0); lcd.print(spinner_chars[index++ % sizeof(spinner_chars)]);
}
void SPINNER_Status() {
  static unsigned long lastUpdate = 0;
  const unsigned long interval = 300;
  if (millis() - lastUpdate >= interval) {
    lastUpdate = millis();
    if (pwm_value > 0) SPINNER_C(); else SPINNER_X();
  }
}

//************************************************************************************
// Power Readout (W): Input when Present, Battery Otherwise
// Displays real-time power consumption or generation
//************************************************************************************
void Battery_Power_Display() {
  if (rebootNotified) return;
  lcd.setCursor(1, 3);

  const float POWER_THRESHOLD = 0.02f;

