subashsaraf/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2/ESP32_MultiChem_CC-CV_Charger_Controller_v12.2.ino
  if (input_voltage > input_voltage_min) {
    // Input is available - show input power
    float inputPower = Current_A * input_voltage;
    if (inputPower >= POWER_THRESHOLD) {
      lcd.print(inputPower, 1); lcd.print("W ");
    } else {
      lcd.print(" 0.0W ");
    }
  } else {
    // No input - show battery power consumption (no negative sign)
    float batteryPower = Current_A * bat_voltage;
    if (batteryPower >= POWER_THRESHOLD) {
      lcd.print(batteryPower, 1); lcd.print("W ");
    } else {
      lcd.print(" 0.0W ");
    }
  }
}

////************************************************************************************
//// Serial Logs (Rate-limited to 1 Hz)
//// Includes division by zero guard in duty calculation for safety
////************************************************************************************
//void logDataToSerial() {
//  static unsigned long last = 0;
//  const unsigned long period = 1000;
//  if (millis() - last < period) return;
//  last = millis();
//
//  DEBUG_PRINT("["); DEBUG_PRINT(millis() / 1000);
//  DEBUG_PRINT("s] ");
//  DEBUG_PRINT("Input V: "); DEBUG_PRINT(input_voltage, 2); DEBUG_PRINT(" V  ");
//  DEBUG_PRINT("Batt V: ");  DEBUG_PRINT(bat_voltage, 2); DEBUG_PRINT(" V  ");
//  DEBUG_PRINT("Current: "); DEBUG_PRINT(Current_A, 2); DEBUG_PRINT(" A  ");
//
//  // === IR2104 CHANGE ===
//  // Log % relative to user-defined limit
//  int maxDuty = PWM_MAX_DUTY;
//  // Division by zero guard
//  int dutyPct = 0;
//  if (maxDuty > 0) {
//    dutyPct = (pwm_value * 100) / maxDuty;
//    dutyPct = constrain(dutyPct, 0, 100);
//  }
//
//  DEBUG_PRINT("PWM: ");     DEBUG_PRINT(dutyPct);           DEBUG_PRINT("%  ");
//  DEBUG_PRINT("(Limit: ");  DEBUG_PRINT(PWM_FULL_SCALE_LIMIT); DEBUG_PRINT("%)  ");
//
//  // Assumes fan_control.h exposes getFanDuty() and FAN_MAX_DUTY
//  int fanDutyPct = (getFanDuty() * 100) / FAN_MAX_DUTY;
//  DEBUG_PRINT("FanPWM: ");  DEBUG_PRINT(fanDutyPct);
//  DEBUG_PRINT("%  ");
//  DEBUG_PRINT("Temp: ");    DEBUG_PRINT(temperatureC, 1);  DEBUG_PRINT(" °C  ");
//  DEBUG_PRINT("Mode: ");    DEBUG_PRINT(mode_str);         DEBUG_PRINT("  ");
//  DEBUG_PRINT("Load: ");    DEBUG_PRINT(load_status);
//  DEBUG_PRINT(" | LoadMode: "); DEBUG_PRINT(loadControlModeStr);
//
//  DEBUG_PRINT(" | Calib: "); DEBUG_PRINT(ACS_OFFSET_VOLTAGE, 3); DEBUG_PRINTLN(" V");
//}


////************************************************************************************
//// Serial Logs (Rate-limited to 1 Hz)
//// Includes division by zero guard in duty calculation for safety
////************************************************************************************
//void logDataToSerial() {
//  static unsigned long last = 0;
//  const unsigned long period = 1000;
//  if (millis() - last < period) return;
//  last = millis();
//
//  // Timestamp
//  DEBUG_PRINT("[");
//  DEBUG_PRINT(millis() / 1000);
//  DEBUG_PRINT("s] ");
//
//  // Voltages & Current
//  DEBUG_PRINT("Input V: ");
//  DEBUG_PRINT(input_voltage, 2);
//  DEBUG_PRINT(" V  ");
//
//  DEBUG_PRINT("Batt V: ");
//  DEBUG_PRINT(bat_voltage, 2);
//  DEBUG_PRINT(" V  ");
//
//  DEBUG_PRINT("Current: ");
//  DEBUG_PRINT(Current_A, 2);
//  DEBUG_PRINT(" A  ");
//
//  // PWM percentage relative to user-defined limit
//  int dutyPct = 0;
//  if (PWM_MAX_DUTY > 0) {
//    dutyPct = (pwm_value * 100) / PWM_MAX_DUTY;
//    dutyPct = constrain(dutyPct, 0, 100);
//  }
//
//  DEBUG_PRINT("PWM: ");
//  DEBUG_PRINT(dutyPct);
//  DEBUG_PRINT("%  ");
//
//  DEBUG_PRINT("(Limit: ");
//  DEBUG_PRINT(PWM_FULL_SCALE_LIMIT);
//  DEBUG_PRINT("%)  ");
//
//  // Fan PWM
//  int fanDutyPct = (getFanDuty() * 100) / FAN_MAX_DUTY;
//  DEBUG_PRINT("FanPWM: ");
//  DEBUG_PRINT(fanDutyPct);
//  DEBUG_PRINT("%  ");
//
//  // Temperature
//  DEBUG_PRINT("Temp: ");
//  DEBUG_PRINT(temperatureC, 1);
//  DEBUG_PRINT(" °C  ");
//
//  // Mode & Load
//  DEBUG_PRINT("Mode: ");
//  DEBUG_PRINT(mode_str);
//  DEBUG_PRINT("  ");
//
//  DEBUG_PRINT("Load: ");
//  DEBUG_PRINT(load_status);
//
//  DEBUG_PRINT(" | LoadMode: ");
//  DEBUG_PRINT(loadControlModeStr);
//
//  // Calibration info
//  DEBUG_PRINT(" | Calib: ");
//  DEBUG_PRINT(ACS_OFFSET_VOLTAGE, 3);
//  DEBUG_PRINTLN(" V");
//}


//************************************************************************************
// Serial Logs (Rate-limited to 1 Hz)
// Includes next-mode and timer visibility
//************************************************************************************
void logDataToSerial() {
  static unsigned long last = 0;
  const unsigned long period = 1000;
  if (millis() - last < period) return;
  last = millis();

  unsigned long now = millis();

  // Timestamp
  DEBUG_PRINT("[");
  DEBUG_PRINT(now / 1000);
  DEBUG_PRINT("s] ");

  // Voltages & Current
  DEBUG_PRINT("Input V: ");
  DEBUG_PRINT(input_voltage, 2);
  DEBUG_PRINT(" V  ");

  DEBUG_PRINT("Batt V: ");
  DEBUG_PRINT(bat_voltage, 2);
  DEBUG_PRINT(" V  ");

  DEBUG_PRINT("Current: ");
  DEBUG_PRINT(Current_A, 2);
  DEBUG_PRINT(" A  ");

  // PWM %
  int dutyPct = 0;
  if (PWM_MAX_DUTY > 0) {
    dutyPct = (pwm_value * 100) / PWM_MAX_DUTY;
    dutyPct = constrain(dutyPct, 0, 100);
  }

  DEBUG_PRINT("PWM: ");
  DEBUG_PRINT(dutyPct);
  DEBUG_PRINT("%  ");

  DEBUG_PRINT("(Limit: ");
  DEBUG_PRINT(PWM_FULL_SCALE_LIMIT);
  DEBUG_PRINT("%)  ");

  // Fan
  int fanDutyPct = (getFanDuty() * 100) / FAN_MAX_DUTY;
  DEBUG_PRINT("FanPWM: ");
  DEBUG_PRINT(fanDutyPct);
  DEBUG_PRINT("%  ");

  // Temperature
  DEBUG_PRINT("Temp: ");
  DEBUG_PRINT(temperatureC, 1);
  DEBUG_PRINT(" °C  ");

  // Mode
  DEBUG_PRINT("Mode: ");
  DEBUG_PRINT(mode_str);

  // =====================================================
  // NEXT MODE + TIMER INFO
  // =====================================================
  if (mode == ABSORPTION && g_absorptionHoldStart > 0) {
    unsigned long elapsed = (now - g_absorptionHoldStart) / 1000;
    unsigned long total   = currentBattery.absorption_time_ms / 1000;

    DEBUG_PRINT(" (→ IDLE ");
    DEBUG_PRINT(elapsed);
    DEBUG_PRINT("s / ");
    DEBUG_PRINT(total);
    DEBUG_PRINT("s)");
  }
  else if (mode == FLOAT && g_floatHoldStart > 0) {
    unsigned long elapsed = (now - g_floatHoldStart) / 1000;
    unsigned long total   = currentBattery.float_exit_time_ms / 1000;

    DEBUG_PRINT(" (→ BULK ");
    DEBUG_PRINT(elapsed);
    DEBUG_PRINT("s / ");
    DEBUG_PRINT(total);
    DEBUG_PRINT("s)");
  }
  else if (mode == IDLE && g_idleVoltageDropStart > 0) {
    unsigned long elapsed = (now - g_idleVoltageDropStart) / 1000;
    unsigned long total   = currentBattery.idle_exit_time_ms / 1000;

    DEBUG_PRINT(" (→ BULK ");
    DEBUG_PRINT(elapsed);
    DEBUG_PRINT("s / ");
    DEBUG_PRINT(total);
    DEBUG_PRINT("s)");
  }

  DEBUG_PRINT("  ");

  // Load info
  DEBUG_PRINT("Load: ");
  DEBUG_PRINT(load_status);
  DEBUG_PRINT(" | LoadMode: ");
  DEBUG_PRINT(loadControlModeStr);

  // Calibration
  DEBUG_PRINT(" | Calib: ");
  DEBUG_PRINT(ACS_OFFSET_VOLTAGE, 3);
  DEBUG_PRINTLN(" V");
}
